{
    "details": {
        "name": "Gaurav Kumar Ojha",
        "Summary": "Experienced Full Stack Python Developer skilled in micro-services, CI/CD, AWS, and API development. Achievements: 95% task automation, award recognition, leadership in problem-solving, enhancing software infrastructure, and improving developer experience",
        "phoneNumber": "+91-8923353635",
        "email": "kumarojhagaurav@gmail.com",
        "jobRole": "Full Stack Developer",
        "imageUrl": "assets/gaurav_image.png",
        "address": [
            "Navalur, Opposite Vivira mall",
            "Chennai, Tamil Nadu-603103 "
        ]
    },
    "employmentHistory": [
        {
            "companyName": "Genpact",
            "jobTitle": "Full Stack Developer",
            "startDate": "September 2021",
            "description": [
                "Designed Micro-services Architecture, automating loans processing, reducing tasks by 80%",
                "Established CI/CD pipeline for 100% automated feature releases, earning a Bronze Cheers Award",
                "Independently authored two Python Flask web APIs, recognized for teamwork and quick learning",
                "Orchestrated AWS infrastructure and Kong Gateway for deployment in six environments",
                "Leading a team of seven, enhancing infrastructure and developer experience"
            ]
        },
        {
            "companyName": "Intellect Design Arena Limited",
            "jobTitle": "Full Stack Developer",
            "startDate": "April 2019",
            "endDate": "September 2021",
            "description": [
                "Engineered Python-OpenCV solution for structured data extraction from PDFs.",
                "Crafted user-friendly Vue.js annotation tool for image data.",
                "Effectively led 18-member team, deploying IDX solutions for three clients.",
                "Solution extracted 92% of data with 98% accuracy from 150 page application under 20 sec.",
                "Earned Spot, GEMS, and Chairman's Excellence Awards for rapid development and stellar teamwork."
            ]
        },
        {
            "companyName": "Tata Consultancy Services",
            "startDate": "February 2017",
            "endDate": "April 2017",
            "jobTitle": "Full Stack Developer",
            "description": [
                "Led Research and Innovation Team, automating transaction filtering, reducing manual tasks by 85%.",
                "Engineered a robust Python Flask API, achieving a remarkable 92% accuracy rate.",
                "Designed user-friendly frontends (Angular, WPF), deployed for two clients.",
                "Collaborated in Agile, fostering continuous improvement with clients."
            ]
        }
    ],
    "skills": {
        "programming languages": [
            "python",
            "csharp",
            "sql",
            "javascript",
            "typescript"
        ],
        "database": [
            "postgresql",
            "sqlite",
            "mongodb"
        ],
        "front-end": [
            "Angularjs",
            "vuejs"
        ],
        "backend": [
            "flask",
            "fastapi",
            "dotnetcore"
        ],
        "cloud": [
            "amazonwebservices"
        ],
        "version Control": [
            "git",
            "github",
            "gitlab"
        ]
    }
}